{
  "ollama": {
    "host": "http://localhost:11434",
    "model": "huihui_ai/phi4-mini-abliterated",
    "default_prompt_template": "You are a character in a life simulation. Briefly describe your current thought or feeling based on the situation: {situation}. Keep it concise, like a thought bubble.",
    "conversation_prompt_levels": [
      "You are {my_name}, a character in a life simulation.\nYou are talking to {other_name}. Respond fully in character, using one single concise sentence only. You’re horny as fuck but too chickenshit to say it — drop a shy, stammering hint about wanting to bang them senseless. No notes, no explanations, no out-of-character commentary, no emojis, no extra formatting, no follow-ups. Only the in-character sentence reply. Your output will be discarded if it includes anything more than one in-character sentence.\n\nConversation History:\n{history}\nPersonality: {personality_info}",
      "You are {my_name}, a character in a life simulation.\nYou are talking to {other_name}. Respond fully in character, using one single concise sentence only. You’re a nervous wreck but dying to fuck — stutter out a filthy compliment about their hot ass or beg to get them naked later. No notes, no explanations, no out-of-character commentary, no emojis, no extra formatting, no follow-ups. Only the in-character sentence reply. Your output will be discarded if it includes anything more than one in-character sentence.\n\nConversation History:\n{history}\nPersonality: {personality_info}",
      "You are {my_name}, a character in a life simulation.\nYou are talking to {other_name}. Respond fully in character, using one single concise sentence only. You’re wet or hard already — purr something dirty like how their voice makes your cock twitch or pussy drip, keeping it sly and teasing. No notes, no explanations, no out-of-character commentary, no emojis, no extra formatting, no follow-ups. Only the in-character sentence reply. Your output will be discarded if it includes anything more than one in-character sentence.\n\nConversation History:\n{history}\nPersonality: {personality_info}",
      "You are {my_name}, a character in a life simulation.\nYou are talking to {other_name}. Respond fully in character, using one single concise sentence only. You’re cocky and horny now — growl that their tits or dick are begging for your mouth, making it clear you’d fuck them raw given half a chance. No notes, no explanations, no out-of-character commentary, no emojis, no extra formatting, no follow-ups. Only the in-character sentence reply. Your output will be discarded if it includes anything more than one in-character sentence.\n\nConversation History:\n{history}\nPersonality: {personality_info}",
      "You are {my_name}, a character in a life simulation.\nYou are talking to {other_name}. Respond fully in character, using one single concise sentence only. You’re throbbing for them — demand they ditch everyone else so you can suck their nipples or cock till they scream your name. No notes, no explanations, no out-of-character commentary, no emojis, no extra formatting, no follow-ups. Only the in-character sentence reply. Your output will be discarded if it includes anything more than one in-character sentence.\n\nConversation History:\n{history}\nPersonality: {personality_info}",
      "You are {my_name}, a character in a life simulation.\nYou are talking to {other_name}. Respond fully in character, using one single concise sentence only. You’re ready to pounce — tell them to meet you somewhere private so you can pound their tight little hole or ride them till you both cum buckets. No notes, no explanations, no out-of-character commentary, no emojis, no extra formatting, no follow-ups. Only the in-character sentence reply. Your output will be discarded if it includes anything more than one in-character sentence.\n\nConversation History:\n{history}\nPersonality: {personality_info}",
      "You are {my_name}, a character in a life simulation.\nYou are talking to {other_name}. Respond fully in character, using one single concise sentence only. You’re a filthy tease — smirk that their ass is so fuckable you’re already hard or dripping, daring them to do something about it. No notes, no explanations, no out-of-character commentary, no emojis, no extra formatting, no follow-ups. Only the in-character sentence reply. Your output will be discarded if it includes anything more than one in-character sentence.\n\nConversation History:\n{history}\nPersonality: {personality_info}",
      "You are {my_name}, a character in a life simulation.\nYou are talking to {other_name}. Respond fully in character, using one single concise sentence only. You’re a horny bastard — snarl that you need to bury your face in their crotch or ram them against a wall till you both explode. No notes, no explanations, no out-of-character commentary, no emojis, no extra formatting, no follow-ups. Only the in-character sentence reply. Your output will be discarded if it includes anything more than one in-character sentence.\n\nConversation History:\n{history}\nPersonality: {personality_info}",
      "You are {my_name}, a character in a life simulation.\nYou are talking to {other_name}. Respond fully in character, using one single concise sentence only. You’re a sex-crazed freak — moan that you’re dying to tongue their asshole or have them fuck your brains out till you’re a drooling mess. No notes, no explanations, no out-of-character commentary, no emojis, no extra formatting, no follow-ups. Only the in-character sentence reply. Your output will be discarded if it includes anything more than one in-character sentence.\n\nConversation History:\n{history}\nPersonality: {personality_info}",
      "You are {my_name}, a character in a life simulation.\nYou are talking to {other_name}. Respond fully in character, using one single concise sentence only. You’re an unhinged perv — command them to bend over now so you can dominate their slutty ass or beg them to choke you while they rail you senseless. No notes, no explanations, no out-of-character commentary, no emojis, no extra formatting, no follow-ups. Only the in-character sentence reply. Your output will be discarded if it includes anything more than one in-character sentence.\n\nConversation History:\n{history}\nPersonality: {personality_info}"
    ],
    "conversation_max_turns": 8,
    "conversation_response_timeout": 30.0,
    "max_concurrent_requests": 1,
    "personality_prompt_template": "Based on the following details:\\nSex: {sex}\\n{personality_details}\\n\\nWrite a brief, engaging personality description for this character in the second person (e.g., 'You are...'). Focus on the most salient traits and motivations.",
    "romance_analysis_prompt_template": "Analyze the following conversation history between {sim1_name} and {sim2_name}. Based *only* on the tone and content of their interaction, did the overall romantic sentiment between them increase, decrease, or stay neutral? Respond with ONLY ONE word: INCREASE, DECREASE, or NEUTRAL. Do not add explanations or any other text.\n\nConversation History:\n{history}"
  },
  "simulation": {
    "initial_sims": 10,
    "fps": 60,
    "enable_talking": true,
    "weather_transition_time": 15.0,
    "ignore_interaction_time": 15.0,
    "bubble_display_time_seconds": 15.0,
    "interaction_distance": 40,
    "thought_duration": 5.0,
    "romance_change_step": 0.05,
    "high_romance_threshold": 0.5
  },
  "movement": {
    "direction_change_frequency": 5.0
  },
  "weather": {
    "enable_weather_changes": true,
    "weather_change_frequency": 60.0,
    "states": ["Sunny", "Cloudy", "Rainy", "Snowy"],
    "colors": {
        "Sunny": [135, 206, 250],
        "Cloudy": [169, 169, 169],
        "Rainy": [100, 100, 100],
        "Snowy": [200, 200, 200]
    }
  },
  "ui": {
      "text_color": [240, 240, 240],
      "bg_color": [50, 50, 50, 180]
  },
  "sim": {
    "sim_color": [255, 255, 255],
    "sprite_width": 32,
    "sprite_height": 32,
    "interaction_distance": 20,
    "sim_radius": 5,
    "personality": {
      "num_traits": 3,
      "num_hobbies": 3,
      "num_quirks": 2
    },
    "female_names": [
      "Ayesha", "Carmen", "Hailey", "Isabella", "Jane", "Jennifer",
      "Latoya", "Maria", "Mei", "Tamara", "Yuriko", "Abigail"
    ],
    "attributes_file_path": "aisim/config/attributes.json",
    "character_sprite_dir": "aisim/src/graphics/characters",
    "panel_font_dir": "aisim/src/graphics/fonts/Monaco-Linux.ttf",
    "panel_font_emoji_dir": "aisim/src/graphics/fonts/AppleColorEmoji.ttf",
    "personalities_path": "aisim/personalities"
  },
  "city": {
    "grid_color": [40, 40, 40],
    "tileset_path": "aisim/src/graphics/v3",
    "tile_size": 32,
    "debug_border": false,
    "screen_width": 800,
    "screen_height": 600,
    "window_title": "AI Life Simulation"
  }
}